zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/saml21j-pinctrl.h
/* pa24g_usb_dm */
#define PA24G_USB_DM \
	SAM_PINMUX(a, 24, g, periph)

/* pa25_gpio */
#define PA25_GPIO \
	SAM_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint13 */
#define PA25A_EIC_EXTINT13 \
	SAM_PINMUX(a, 25, a, periph)

/* pa25c_sercom3_pad3 */
#define PA25C_SERCOM3_PAD3 \
	SAM_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad3 */
#define PA25D_SERCOM5_PAD3 \
	SAM_PINMUX(a, 25, d, periph)

/* pa25e_tc1_wo1 */
#define PA25E_TC1_WO1 \
	SAM_PINMUX(a, 25, e, periph)

/* pa25f_tcc1_wo3 */
#define PA25F_TCC1_WO3 \
	SAM_PINMUX(a, 25, f, periph)

/* pa25g_usb_dp */
#define PA25G_USB_DP \
	SAM_PINMUX(a, 25, g, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint15 */
#define PA27A_EIC_EXTINT15 \
	SAM_PINMUX(a, 27, a, periph)

/* pa27h_gclk_io0 */
#define PA27H_GCLK_IO0 \
	SAM_PINMUX(a, 27, h, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint10 */
#define PA30A_EIC_EXTINT10 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 \
	SAM_PINMUX(a, 30, d, periph)

/* pa30e_tcc1_wo0 */
#define PA30E_TCC1_WO0 \
	SAM_PINMUX(a, 30, e, periph)

/* pa30h_gclk_io0 */
#define PA30H_GCLK_IO0 \
	SAM_PINMUX(a, 30, h, periph)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint11 */
#define PA31A_EIC_EXTINT11 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 \
	SAM_PINMUX(a, 31, d, periph)

/* pa31e_tcc1_wo1 */
#define PA31E_TCC1_WO1 \
	SAM_PINMUX(a, 31, e, periph)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_eic_extint0 */
#define PB0A_EIC_EXTINT0 \
	SAM_PINMUX(b, 0, a, periph)

/* pb0b_adc_ain8 */
#define PB0B_ADC_AIN8 \
	SAM_PINMUX(b, 0, b, periph)

/* pb0d_sercom5_pad2 */
#define PB0D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 0, d, periph)

/* pb0e_tc3_wo0 */
#define PB0E_TC3_WO0 \
	SAM_PINMUX(b, 0, e, periph)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_eic_extint1 */
#define PB1A_EIC_EXTINT1 \
	SAM_PINMUX(b, 1, a, periph)

/* pb1b_adc_ain9 */
#define PB1B_ADC_AIN9 \
	SAM_PINMUX(b, 1, b, periph)

/* pb1d_sercom5_pad3 */
#define PB1D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 1, d, periph)

/* pb1e_tc3_wo1 */
#define PB1E_TC3_WO1 \
	SAM_PINMUX(b, 1, e, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_adc_ain10 */
#define PB2B_ADC_AIN10 \
	SAM_PINMUX(b, 2, b, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 2, d, periph)

/* pb2e_tc2_wo0 */
#define PB2E_TC2_WO0 \
	SAM_PINMUX(b, 2, e, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_adc_ain11 */
#define PB3B_ADC_AIN11 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 3, d, periph)

/* pb3e_tc2_wo1 */
#define PB3E_TC2_WO1 \
	SAM_PINMUX(b, 3, e, periph)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_adc_ain12 */
#define PB4B_ADC_AIN12 \
	SAM_PINMUX(b, 4, b, periph)

/* pb4b_ptc_y10 */
#define PB4B_PTC_Y10 \
	SAM_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_adc_ain13 */
#define PB5B_ADC_AIN13 \
	SAM_PINMUX(b, 5, b, periph)

/* pb5b_ptc_y11 */
#define PB5B_PTC_Y11 \
	SAM_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 \
	SAM_PINMUX(b, 6, a, periph)

/* pb6b_adc_ain14 */
#define PB6B_ADC_AIN14 \
	SAM_PINMUX(b, 6, b, periph)

/* pb6b_ptc_y12 */
#define PB6B_PTC_Y12 \
	SAM_PINMUX(b, 6, b, periph)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 \
	SAM_PINMUX(b, 7, a, periph)

/* pb7b_adc_ain15 */
#define PB7B_ADC_AIN15 \
	SAM_PINMUX(b, 7, b, periph)

/* pb7b_ptc_y13 */
#define PB7B_PTC_Y13 \
	SAM_PINMUX(b, 7, b, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 \
	SAM_PINMUX(b, 8, a, periph)

/* pb8b_adc_ain2 */
#define PB8B_ADC_AIN2 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8e_tc0_wo0 */
#define PB8E_TC0_WO0 \
	SAM_PINMUX(b, 8, e, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_adc_ain3 */
#define PB9B_ADC_AIN3 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_ptc_y15 */
#define PB9B_PTC_Y15 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 \
	SAM_PINMUX(b, 9, d, periph)

/* pb9e_tc0_wo1 */
#define PB9E_TC0_WO1 \
	SAM_PINMUX(b, 9, e, periph)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 \
	SAM_PINMUX(b, 10, a, periph)

/* pb10b_ptc_y2 */
#define PB10B_PTC_Y2 \
	SAM_PINMUX(b, 10, b, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 \
	SAM_PINMUX(b, 10, d, periph)

/* pb10e_tc1_wo0 */
#define PB10E_TC1_WO0 \
	SAM_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 \
	SAM_PINMUX(b, 10, f, periph)

/* pb10h_gclk_io4 */
#define PB10H_GCLK_IO4 \
	SAM_PINMUX(b, 10, h, periph)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 \
	SAM_PINMUX(b, 11, a, periph)

/* pb11b_ptc_y3 */
#define PB11B_PTC_Y3 \
	SAM_PINMUX(b, 11, b, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 \
	SAM_PINMUX(b, 11, d, periph)

/* pb11e_tc1_wo1 */
#define PB11E_TC1_WO1 \
	SAM_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 \
	SAM_PINMUX(b, 11, f, periph)

/* pb11h_gclk_io5 */
#define PB11H_GCLK_IO5 \
	SAM_PINMUX(b, 11, h, periph)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

