zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/saml21j-pinctrl.h
/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12b_ptc_x12 */
#define PB12B_PTC_X12 \
	SAM_PINMUX(b, 12, b, periph)

/* pb12b_ptc_y5 */
#define PB12B_PTC_Y5 \
	SAM_PINMUX(b, 12, b, periph)

/* pb12c_sercom4_pad0 */
#define PB12C_SERCOM4_PAD0 \
	SAM_PINMUX(b, 12, c, periph)

/* pb12e_tc0_wo0 */
#define PB12E_TC0_WO0 \
	SAM_PINMUX(b, 12, e, periph)

/* pb12f_tcc0_wo6 */
#define PB12F_TCC0_WO6 \
	SAM_PINMUX(b, 12, f, periph)

/* pb12h_gclk_io6 */
#define PB12H_GCLK_IO6 \
	SAM_PINMUX(b, 12, h, periph)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_ptc_x13 */
#define PB13B_PTC_X13 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13b_ptc_y14 */
#define PB13B_PTC_Y14 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_sercom4_pad1 */
#define PB13C_SERCOM4_PAD1 \
	SAM_PINMUX(b, 13, c, periph)

/* pb13e_tc0_wo1 */
#define PB13E_TC0_WO1 \
	SAM_PINMUX(b, 13, e, periph)

/* pb13f_tcc0_wo7 */
#define PB13F_TCC0_WO7 \
	SAM_PINMUX(b, 13, f, periph)

/* pb13h_gclk_io7 */
#define PB13H_GCLK_IO7 \
	SAM_PINMUX(b, 13, h, periph)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 \
	SAM_PINMUX(b, 14, a, periph)

/* pb14b_ptc_x14 */
#define PB14B_PTC_X14 \
	SAM_PINMUX(b, 14, b, periph)

/* pb14c_sercom4_pad2 */
#define PB14C_SERCOM4_PAD2 \
	SAM_PINMUX(b, 14, c, periph)

/* pb14e_tc1_wo0 */
#define PB14E_TC1_WO0 \
	SAM_PINMUX(b, 14, e, periph)

/* pb14h_gclk_io0 */
#define PB14H_GCLK_IO0 \
	SAM_PINMUX(b, 14, h, periph)

/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 \
	SAM_PINMUX(b, 15, a, periph)

/* pb15b_ptc_x15 */
#define PB15B_PTC_X15 \
	SAM_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 \
	SAM_PINMUX(b, 15, c, periph)

/* pb15e_tc1_wo1 */
#define PB15E_TC1_WO1 \
	SAM_PINMUX(b, 15, e, periph)

/* pb15h_gclk_io1 */
#define PB15H_GCLK_IO1 \
	SAM_PINMUX(b, 15, h, periph)

/* pb16_gpio */
#define PB16_GPIO \
	SAM_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 \
	SAM_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 \
	SAM_PINMUX(b, 16, c, periph)

/* pb16e_tc2_wo0 */
#define PB16E_TC2_WO0 \
	SAM_PINMUX(b, 16, e, periph)

/* pb16f_tcc0_wo4 */
#define PB16F_TCC0_WO4 \
	SAM_PINMUX(b, 16, f, periph)

/* pb16h_gclk_io2 */
#define PB16H_GCLK_IO2 \
	SAM_PINMUX(b, 16, h, periph)

/* pb17_gpio */
#define PB17_GPIO \
	SAM_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 \
	SAM_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 \
	SAM_PINMUX(b, 17, c, periph)

/* pb17e_tc2_wo1 */
#define PB17E_TC2_WO1 \
	SAM_PINMUX(b, 17, e, periph)

/* pb17f_tcc0_wo5 */
#define PB17F_TCC0_WO5 \
	SAM_PINMUX(b, 17, f, periph)

/* pb17h_gclk_io3 */
#define PB17H_GCLK_IO3 \
	SAM_PINMUX(b, 17, h, periph)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	SAM_PINMUX(b, 22, a, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 22, d, periph)

/* pb22e_tc3_wo0 */
#define PB22E_TC3_WO0 \
	SAM_PINMUX(b, 22, e, periph)

/* pb22h_gclk_io0 */
#define PB22H_GCLK_IO0 \
	SAM_PINMUX(b, 22, h, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	SAM_PINMUX(b, 23, a, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 23, d, periph)

/* pb23e_tc3_wo1 */
#define PB23E_TC3_WO1 \
	SAM_PINMUX(b, 23, e, periph)

/* pb23h_gclk_io1 */
#define PB23H_GCLK_IO1 \
	SAM_PINMUX(b, 23, h, periph)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	SAM_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad0 */
#define PB30D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 30, d, periph)

/* pb30e_tcc0_wo0 */
#define PB30E_TCC0_WO0 \
	SAM_PINMUX(b, 30, e, periph)

/* pb30f_tcc1_wo2 */
#define PB30F_TCC1_WO2 \
	SAM_PINMUX(b, 30, f, periph)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	SAM_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad1 */
#define PB31D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 31, d, periph)

/* pb31e_tcc0_wo1 */
#define PB31E_TCC0_WO1 \
	SAM_PINMUX(b, 31, e, periph)

/* pb31f_tcc1_wo3 */
#define PB31F_TCC1_WO3 \
	SAM_PINMUX(b, 31, f, periph)
